# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

def func(point1, point2):
    result = ((point1[0]-point2[0])**2 + (point1[1]-point2[1])**2)**0.5
    print(f'Расстояние между точкой 1 с координатами{point1} и точкой 2 с координатами {point2} = {round(result, 4)}')


func(point1 = [3,5], point2 = [8,32])

func(point1 = [-9,5], point2 = [16,12])

func(point1 = [3,18], point2 = [8,-34])

func(point1 = [25,5], point2 = [25,-84])